app/Controllers/EmpruntsController.php

SELECT *
FROM `emprunts`
WHERE `date_retour` IS NULL
SELECT *
FROM `livres`
WHERE `id` NOT IN ('1','2')
---
    public function disponibles()
    {
        $livresModel = new Livres();
        $empruntsModel = new Emprunts();
        $empruntsActifs = $empruntsModel->where('date_retour', null)->findAll();
        $emprunteIds = [];
        if (!empty($empruntsActifs)) {
            foreach ($empruntsActifs as $e) {
                $emprunteIds[] = $e['livre_id'];
            }
        }
        if (!empty($emprunteIds)) {
            $livredisponible = $livresModel->whereNotIn('id', $emprunteIds)->findAll();

INSERT INTO `emprunts` (`livre_id`, `nom_emprunteur`, `date_emprunt`, `date_retour`) VALUES ('2', 'Emprunteur Anonyme', '2026-04-25', NULL)
---
    public function emprunter($id)
    {
        $empruntsModel = new Emprunts();
        $empruntsModel->insert([
            'livre_id' => $id,
            'nom_emprunteur' => 'Emprunteur Anonyme',
            'date_emprunt' => Time::now()->toDateString(),
            'date_retour' => null
        ]);