app/Controllers/LivresController.php

    public function liste()
    {
        $livres=new Livres();
        $Livres=$livres->findAll();
---
SELECT *
FROM `livres`

    public function details($id)
    {
        $livres=new Livres();
        $livre=$livres->find($id);
---
SELECT *
FROM `livres`
WHERE `livres`.`id` = '2'