app/Controllers/PageController.php

    public function home() {
        $clientModel = new Client();
        $prefixeModel = new Prefixe();
        $client = $clientModel->find(session()->get('id'));
---
SELECT *
FROM `Client`
WHERE `Client`.`id` = '1'